---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointElementNonNormalizedCurveParamater
source: html/157e407a-f2df-6033-4703-d5fe70d556a2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointElementNonNormalizedCurveParamater Property

"Non-Normalized Curve Parameter"

## Syntax (C#)
```csharp
public static ForgeTypeId PointElementNonNormalizedCurveParamater { get; }
```